Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLineAttributes.DrawOnlyTextLabelsNotGridLines Property
 Set as true if you don't want to draw the grid lines, only show the grid lines' text labels.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawOnlyTextLabelsNotGridLines { get; set; }
Public Property DrawOnlyTextLabelsNotGridLines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GridLine.GridLineAttributes Class
Tekla.Structures.Drawing Namespace